In [9]:
import pandas as pd

In [10]:
l = [10,20,30,40,50]
s = pd.Series((l) , index=['a','b','c','d','e'])
s

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [11]:
l1 = [60,70,80,90,100]
s1 = pd.Series((l1) , index=['a','b','c','d','e'])
s1

a     60
b     70
c     80
d     90
e    100
dtype: int64

In [12]:
a=pd.concat([s,s1])
a

a     10
b     20
c     30
d     40
e     50
a     60
b     70
c     80
d     90
e    100
dtype: int64

In [13]:
s * s1

a     600
b    1400
c    2400
d    3600
e    5000
dtype: int64

In [14]:
s + s1

a     70
b     90
c    110
d    130
e    150
dtype: int64

In [37]:
s.mean()

np.float64(30.0)

In [38]:
s.mode()

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [39]:
s1.sum()

np.int64(400)

In [15]:
s**2

a     100
b     400
c     900
d    1600
e    2500
dtype: int64

## Merge
* pd.merge() function is used to combine two different DataFrames
* How to merge (inner, left, right, outer)

In [27]:
data_users = {
    'UserID': [101, 102, 103, 104],
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'City': ['NY', 'LA', 'NY', 'SF']
}
users = pd.DataFrame(data_users)
users

   UserID     Name City
0     101    Alice   NY
1     102      Bob   LA
2     103  Charlie   NY
3     104    David   SF

In [28]:
data_orders = {
    'User_ID_FK': [102, 101, 104, 105], 
    'Product': ['Mouse', 'Laptop', 'Keyboard', 'Monitor'],
    'Price': [25, 1200, 75, 300]
}
orders = pd.DataFrame(data_orders)
orders

   User_ID_FK   Product  Price
0         102     Mouse     25
1         101    Laptop   1200
2         104  Keyboard     75
3         105   Monitor    300

In [35]:
merged = pd.merge(
    users,            
    orders,            
    left_on='UserID',     
    right_on='User_ID_FK', 
    how='inner'            
)

print(merged)

   UserID   Name City  User_ID_FK   Product  Price
0     101  Alice   NY         101    Laptop   1200
1     102    Bob   LA         102     Mouse     25
2     104  David   SF         104  Keyboard     75

## Join
* .join() method primarily combines DataFrames based on their indexes

In [36]:
users.join(orders , how ='left')

   UserID     Name City  User_ID_FK   Product  Price
0     101    Alice   NY         102     Mouse     25
1     102      Bob   LA         101    Laptop   1200
2     103  Charlie   NY         104  Keyboard     75
3     104    David   SF         105   Monitor    300